# Specify application directory for casks
cask_args appdir: "/Applications"

# Tap repositories
tap "azure/bicep"
tap "azure/functions"
tap "fastrepl/hyprnote"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "oven-sh/bun"
tap "powershell/tap"
tap "sst/tap"

# Formulae
brew "azure-cli"
brew "codex"
brew "gh"
brew "gitleaks"
brew "go"
brew "node"
brew "ollama", restart_service: :changed
brew "pipx"
brew "python@3.13"
brew "starship"
brew "tree"
brew "uv"
brew "wakeonlan"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "azure/bicep/bicep"

# Casks
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "appcleaner"
cask "balenaetcher"
cask "chatgpt"
cask "claude-code"
cask "cleanshot"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "macwhisper"
cask "microsoft-edge"
cask "pocket-casts"
cask "postman"
cask "powershell"
cask "raycast"
cask "spotify"
cask "stats"
cask "visual-studio-code"

# VS Code Extensions
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "openai.chatgpt"