# Specify application directory for casks
cask_args appdir: "/Applications"

# Tap repositories
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Formulae
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "bicep"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "gemini-cli"
brew "go"
brew "icu4c@77"
brew "libnghttp2"
brew "libsodium"
brew "libuv"
brew "libyaml"
brew "mpdecimal"
brew "node"
brew "ollama"
brew "openssl@3"
brew "python@3.12"
brew "readline"
brew "sqlite"
brew "starship"
brew "tree"
brew "wakeonlan"
brew "xz"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "appcleaner"
cask "balenaetcher"
cask "chatgpt"
cask "cleanshot"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "macwhisper"
cask "microsoft-edge"
cask "pocket-casts"
cask "postman"
cask "powershell"
cask "raycast"
cask "stats"
cask "visual-studio-code"
